### Forest: Lotus Mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.lotus-mainnet.data.digitalocean_project.forest_project: Reading...
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.lotus-mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=dba44b83-3de0-11ee-b561-0a58ac14d1dc]
module.lotus-mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.lotus-mainnet.digitalocean_droplet.forest: Refreshing state... [id=370584867]
module.lotus-mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=3337d740-2ed3-46ee-97bb-8e66a32adf47]
module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=370584867-dba44b83-3de0-11ee-b561-0a58ac14d1dc-20230818160530965600000001]
module.lotus-mainnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.lotus-mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lotus-mainnet.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-08-18T16:04:05Z" -> (known after apply)
      ~ disk                 = 320 -> (known after apply)
      ~ id                   = "370584867" -> (known after apply)
      ~ ipv4_address         = "207.154.204.25" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "lotus-mainnet"
      ~ price_hourly         = 0.14286 -> (known after apply)
      ~ price_monthly        = 96 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "mainnet",
        ]
      ~ urn                  = "do:droplet:370584867" -> (known after apply)
      ~ user_data            = "543683174c2b8dd07e26cfc2b6673b88e22f2038" -> "79a061d2c17db77525aba3a48e3028bd9f39da00" # forces replacement
      ~ vcpus                = 8 -> (known after apply)
      ~ volume_ids           = [
          - "dba44b83-3de0-11ee-b561-0a58ac14d1dc",
        ] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.lotus-mainnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 370584867,
        ] -> (known after apply)
        id              = "3337d740-2ed3-46ee-97bb-8e66a32adf47"
        name            = "lotus-mainnet-fw"
        tags            = [
            "mainnet",
        ]
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.lotus-mainnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:370584867",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.lotus-mainnet.digitalocean_volume_attachment.forest_volume[0] must be replaced
-/+ resource "digitalocean_volume_attachment" "forest_volume" {
      ~ droplet_id = 370584867 # forces replacement -> (known after apply) # forces replacement
      ~ id         = "370584867-dba44b83-3de0-11ee-b561-0a58ac14d1dc-20230818160530965600000001" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>